dgarske/wolfssl-examples-stm32/STM32_Bare_Test/src/main_dhuk.c
/* main_dhuk.c
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * DHUK (Device Hardware Unique Key) test app for STM32_Bare_Test, exercising
 * the transparent crypto-callback DHUK path (the STM32 cryptocb device, see
 * wc_Stm32_DhukRegister). Build with: make BOARD=u3 CONFIG=bare TARGET=dhuk
 *
 *   [1] wc_ecc_import_wrapped_private input validation -- a pure-software
 *       hard PASS/FAIL covering the seed + wrapped-scalar bounds checks.
 *   [2] GMAC via the transparent crypto-callback (normal wc_AesGcmEncrypt on
 *       a DHUK-keyed Aes; derived key never in software).
 *   [3] AES-ECB via the transparent crypto-callback (wc_AesEcb*; round-trip +
 *       seed-dependence confirm the DHUK key drives the cipher).
 *   [4] ECDSA sign via the transparent crypto-callback (wc_ecc_sign_hash with
 *       a DHUK-wrapped scalar; verified with the public counterpart).
 *   [7] wc_Stm32_Aes_Wrap blob word order -- runs on both build paths so the
 *       shared WC_STM32_WRAP_ORDER_RAW blob can be compared bare vs CubeMX,
 *       and each build's default order is asserted (raw on bare, legacy
 *       byte-reversed on CubeMX, preserving wolfSSL 5.9.0 - 5.9.2 blobs).
 *   [8] Provisioning reference -- the minimal shape a product uses: data
 *       encryption under a DHUK-derived key, an external AES-256 key kept
 *       under a DHUK KEK, and ECDSA with a DHUK-wrapped private scalar.
 *       Read this one first if you are integrating rather than testing.
 *  [10] ECDSA sign from a wrapped scalar imported onto a key that never saw
 *       keygen -- the runtime shape, and a guard that the import leaves the
 *       key ready to sign.
 *   [9] wc_Stm32_Aes_Wrap blob used as a key -- the integration pattern that
 *       silently returns wrong plaintext, reproduced so the failure is
 *       visible, with the KEK pattern that works asserted beside it.
 *
 * A backend that is gated off or unavailable (CRYPTOCB_UNAVAILABLE / a
 * TZEN-secure-context timeout) is reported as an expected soft-PASS, not a
 * failure. Results are also mirrored to the g_dhuk_res debugger sink. */

#include <stdio.h>

#include "board.h"

extern uint32_t SystemCoreClock;
extern void     SystemCoreClockUpdate(void);

#include "wolfssl/wolfcrypt/settings.h"
#include "wolfssl/version.h"
#include "wolfssl/wolfcrypt/types.h"
#include "wolfssl/wolfcrypt/wc_port.h"
#include "wolfssl/wolfcrypt/error-crypt.h"
#include "wolfssl/wolfcrypt/random.h"
#include "wolfssl/wolfcrypt/ecc.h"
#include "wolfssl/wolfcrypt/port/st/stm32.h"
#include "wolfssl/wolfcrypt/aes.h"

#ifndef BUILD_CONFIG_NAME
#define BUILD_CONFIG_NAME "unknown"
#endif

/* Debugger-readable result sink, so results can be captured without a
 * working VCP (the B-U585I-IOT02A's UART routing differs from the
 * NUCLEO-U585AI-Q this board build targets). Read after the run with:
 *   arm-none-eabi-nm app.elf | grep g_dhuk_res   # address
 *   openocd ... -c "mdw 0x<addr> 12"
 * Captures the RAW return codes (before the soft-PASS mapping) so a
 * gated/timeout (-271 / WC_TIMEOUT_E) is distinguishable from a real
 * success (0). magic = 0xD04B0001 once main() reaches the end. */
volatile struct {
    uint32_t magic;
    int32_t  setter_rc;    /* 0 = all setter validation cases passed   */
    int32_t  cb_gmac_rc;   /* transparent crypto-cb GMAC return        */
    uint32_t cb_gmac_tag[4];/* crypto-cb GMAC tag on success           */
    int32_t  dhukop_rc;    /* wc_Stm32_Aes_DhukOp_ex round-trip return */
    uint32_t dhukop_blob[8];/* chip-bound wrapped blob (cross-build cmp)*/
    int32_t  overall;      /* final result (0 = PASS)                 */
} g_dhuk_res;

/* A backend that is gated off or that cannot complete the unwrap on
 * TZEN=0 silicon returns one of these. Treat as expected, not a fail. */
static int is_expected_gated(int ret)
{
    return (ret == CRYPTOCB_UNAVAILABLE) ||
           (ret == WC_TIMEOUT_E) ||
           (ret == WC_HW_E);
}

/* Compare an actual return code against the expected one. Returns 0 on
 * match, -1 on mismatch (with a printed diagnostic). */
static int expect_ret(const char* label, int got, int want)
{
    if (got != want) {
        printf("  %s: got %d, want %d -- FAIL\n", label, got, want);
        return -1;
    }
    printf("  %s: %d OK\n", label, got);
    return 0;
}

#if defined(WOLFSSL_DHUK) && \
    (defined(WOLFSSL_STM32_BARE) || defined(WOLFSSL_STM32_CUBEMX)) && \
    defined(WC_STM32_HAS_DHUK)

/* [1] wc_ecc_import_wrapped_private input-validation unit test. Pure
 * software; a hard PASS/FAIL exercising the seed + wrapped-scalar bounds checks
 * (including the wrappedLen <= roundup16(plainLen) invariant). */
static int test_ecc_dhuk_setter(void)
{
    /* Content does not matter for the validation paths; only lengths are
     * checked. Sized to the largest blob the import accepts (96 bytes). */
    byte wrapped[96];
    byte seed[32];
    ecc_key key;
    int ret;
    int rc = 0;

    XMEMSET(wrapped, 0xa5, sizeof(wrapped));
    XMEMSET(seed, 0x5a, sizeof(seed));

    ret = wc_ecc_init(&key);
    if (ret != 0) {
        printf("  wc_ecc_init failed: %d\n", ret);
        return ret;
    }

    /* Reject: NULL key / seed / wrapped pointers. */
    ret = wc_ecc_import_wrapped_private(NULL, ECC_SECP256R1, seed, 32,
                                        wrapped, 32, 32);
    if (expect_ret("reject key=NULL", ret, BAD_FUNC_ARG) != 0) rc = -1;
    ret = wc_ecc_import_wrapped_private(&key, ECC_SECP256R1, NULL, 32,
                                        wrapped, 32, 32);
    if (expect_ret("reject seed=NULL", ret, BAD_FUNC_ARG) != 0) rc = -1;
    ret = wc_ecc_import_wrapped_private(&key, ECC_SECP256R1, seed, 32,
                                        NULL, 32, 32);
    if (expect_ret("reject wrapped=NULL", ret, BAD_FUNC_ARG) != 0) rc = -1;

    /* Good: 32-byte seed, 32-byte wrapped scalar, 32-byte plaintext (P-256). */
    ret = wc_ecc_import_wrapped_private(&key, ECC_SECP256R1, seed, 32,
                                        wrapped, 32, 32);
    if (expect_ret("accept P-256 (32/32)", ret, 0) != 0) rc = -1;

    /* Boundary OK: P-521 plaintext (66) padded to 80, blob 80 == max. */
    ret = wc_ecc_import_wrapped_private(&key, ECC_SECP521R1, seed, 32,
                                        wrapped, 80, 66);
    if (expect_ret("accept P-521 (80/66)", ret, 0) != 0) rc = -1;

    /* Reject: plainLen must be the curve's scalar size. 1 byte matches no
     * curve, and a scalar size that disagrees with curve_id is malformed. */
    ret = wc_ecc_import_wrapped_private(&key, ECC_SECP256R1, seed, 32,
                                        wrapped, 16, 1);
    if (expect_ret("reject plain=1 vs P-256", ret, BAD_FUNC_ARG) != 0) rc = -1;
    ret = wc_ecc_import_wrapped_private(&key, ECC_SECP256R1, seed, 32,
                                        wrapped, 48, 48);
    if (expect_ret("reject plain=48 vs P-256", ret, BAD_FUNC_ARG) != 0) rc = -1;

    /* Reject: seed length must be 32. */
    ret = wc_ecc_import_wrapped_private(&key, ECC_SECP256R1, seed, 16,
                                        wrapped, 32, 32);
    if (expect_ret("reject seedSz=16", ret, BAD_FUNC_ARG) != 0) rc = -1;

    /* Reject: not a multiple of the AES block size. */
    ret = wc_ecc_import_wrapped_private(&key, ECC_SECP256R1, seed, 32,
                                        wrapped, 20, 20);
    if (expect_ret("reject wrappedLen=20", ret, BAD_FUNC_ARG) != 0) rc = -1;

