dgarske/wolfssl-examples-stm32/STM32_Bare_Test/src/main_dhuk.c
    /* Reject: zero-length wrapped blob. */
    ret = wc_ecc_import_wrapped_private(&key, ECC_SECP256R1, seed, 32,
                                        wrapped, 0, 0);
    if (expect_ret("reject wrappedLen=0", ret, BAD_FUNC_ARG) != 0) rc = -1;

    /* Reject: larger than the on-key buffer (> 96). */
    ret = wc_ecc_import_wrapped_private(&key, ECC_SECP256R1, seed, 32,
                                        wrapped, 112, 32);
    if (expect_ret("reject wrappedLen=112", ret, BAD_FUNC_ARG) != 0) rc = -1;

    /* Reject: plaintext longer than the wrapped blob. */
    ret = wc_ecc_import_wrapped_private(&key, ECC_SECP256R1, seed, 32,
                                        wrapped, 32, 48);
    if (expect_ret("reject plain=48 > wrapped=32", ret, BAD_FUNC_ARG) != 0)
        rc = -1;

    /* Reject: wrapped blob larger than the plaintext padded to a full block
     * (plain=16 -> roundup16 = 16, so a 48-byte blob is malformed). */
    ret = wc_ecc_import_wrapped_private(&key, ECC_SECP256R1, seed, 32,
                                        wrapped, 48, 16);
    if (expect_ret("reject wrapped=48 > roundup16(plain=16)", ret,
                   BAD_FUNC_ARG) != 0)
        rc = -1;

    wc_ecc_free(&key);
    g_dhuk_res.setter_rc = rc;
    if (rc == 0) {
        printf("  setter validation OK\n");
    }
    return rc;
}

#ifdef WOLF_CRYPTO_CB
/* [2] Transparent crypto-callback GMAC via the STM32 DHUK device. Register the
 * device, init a normal Aes with devId = WC_DHUK_DEVID, set the 256-bit seed as
 * the key (wc_AesGcmSetKey), then call the standard wc_AesGcmEncrypt with empty
 * plaintext (GMAC). The derived key never appears in software. Checks: no
 * timeout, determinism (two runs match), and round-trip verify via
 * wc_AesGcmDecrypt. A gated/timeout result is a soft-PASS. */
static int test_dhuk_cryptocb_gmac(void)
{
    static const byte seed[32] = {
        0x00,0x11,0x22,0x33,0x44,0x55,0x66,0x77,
        0x88,0x99,0xaa,0xbb,0xcc,0xdd,0xee,0xff,
        0x10,0x32,0x54,0x76,0x98,0xba,0xdc,0xfe,
        0xef,0xcd,0xab,0x89,0x67,0x45,0x23,0x01
    };
    static const byte iv[12] = {
        0xca,0xfe,0xba,0xbe,0xfa,0xce,0xdb,0xad,
        0xde,0xca,0xf8,0x88
    };
    static const byte aad[16] = {
        0xfe,0xed,0xfa,0xce,0xde,0xad,0xbe,0xef,
        0xfe,0xed,0xfa,0xce,0xde,0xad,0xbe,0xef
    };
    Aes  aes;
    byte io[1];
    byte tag1[16];
    byte tag2[16];
    int  ret;
    int  i;

    XMEMSET(tag1, 0, sizeof(tag1));
    XMEMSET(tag2, 0, sizeof(tag2));

    ret = wc_Stm32_DhukRegister(WC_DHUK_DEVID);
    if (ret != 0) {
        printf("  wc_Stm32_DhukRegister failed: %d\n", ret);
        return ret;
    }

    /* GMAC tag via the normal AES-GCM API (empty plaintext). */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesGcmSetKey(&aes, seed, (word32)sizeof(seed));
    }
    if (ret == 0) {
        ret = wc_AesGcmEncrypt(&aes, io, io, 0, iv, (word32)sizeof(iv),
                               tag1, (word32)sizeof(tag1),
                               aad, (word32)sizeof(aad));
    }
    wc_AesFree(&aes);
    g_dhuk_res.cb_gmac_rc = ret;
    XMEMCPY((void*)g_dhuk_res.cb_gmac_tag, tag1, sizeof(tag1));

    if (is_expected_gated(ret)) {
        printf("  cryptocb GMAC reachable; backend gated/unavailable "
               "(ret=%d)\n", ret);
        ret = 0; /* soft-PASS */
        goto cleanup;
    }
    if (ret != 0) {
        printf("  cryptocb GMAC failed: %d\n", ret);
        goto cleanup;
    }
    printf("  cryptocb GMAC tag:");
    for (i = 0; i < 16; i++) printf(" %02x", tag1[i]);
    printf("\n");

    /* Determinism: same seed + inputs must give the same tag. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesGcmSetKey(&aes, seed, (word32)sizeof(seed));
    }
    if (ret == 0) {
        ret = wc_AesGcmEncrypt(&aes, io, io, 0, iv, (word32)sizeof(iv),
                               tag2, (word32)sizeof(tag2),
                               aad, (word32)sizeof(aad));
    }
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  cryptocb GMAC (run 2) failed: %d\n", ret);
        goto cleanup;
    }
    if (XMEMCMP(tag1, tag2, 16) != 0) {
        printf("  cryptocb GMAC not deterministic -- FAIL\n");
        ret = -1;
        goto cleanup;
    }
    printf("  cryptocb GMAC deterministic OK\n");

    /* Round-trip: verify the tag via the normal AES-GCM decrypt API. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesGcmSetKey(&aes, seed, (word32)sizeof(seed));
    }
    if (ret == 0) {
        ret = wc_AesGcmDecrypt(&aes, io, io, 0, iv, (word32)sizeof(iv),
                               tag1, (word32)sizeof(tag1),
                               aad, (word32)sizeof(aad));
    }
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  cryptocb GMAC verify failed: %d\n", ret);
        goto cleanup;
    }
    printf("  cryptocb GMAC verify OK (round-trip)\n");
    ret = 0;

cleanup:
    wc_Stm32_DhukUnRegister(WC_DHUK_DEVID);
    return ret;
}

#if defined(HAVE_AES_ECB) || defined(WOLFSSL_AES_DIRECT)
/* [3] Transparent AES-ECB via the STM32 DHUK device. Encrypt/decrypt with the
 * standard wc_AesEcb* API on an Aes inited with devId = WC_DHUK_DEVID and the
 * seed set as the key. Checks: round-trip recovers plaintext, ciphertext !=
 * plaintext (encryption happened), and a DIFFERENT seed yields a DIFFERENT
 * ciphertext (proves the DHUK-derived key actually drives the cipher, i.e. the
 * crypto-callback path is engaged). */
static int test_dhuk_cryptocb_ecb(void)
{
    static const byte seedA[32] = {
        0x00,0x11,0x22,0x33,0x44,0x55,0x66,0x77,
        0x88,0x99,0xaa,0xbb,0xcc,0xdd,0xee,0xff,
        0x10,0x32,0x54,0x76,0x98,0xba,0xdc,0xfe,
        0xef,0xcd,0xab,0x89,0x67,0x45,0x23,0x01
    };
    static const byte seedB[32] = {
        0xa5,0xa5,0xa5,0xa5,0xa5,0xa5,0xa5,0xa5,
        0x5a,0x5a,0x5a,0x5a,0x5a,0x5a,0x5a,0x5a,
        0x01,0x23,0x45,0x67,0x89,0xab,0xcd,0xef,
        0xfe,0xdc,0xba,0x98,0x76,0x54,0x32,0x10
    };
    static const byte pt[16] = {
        0x6b,0xc1,0xbe,0xe2,0x2e,0x40,0x9f,0x96,
        0xe9,0x3d,0x7e,0x11,0x73,0x93,0x17,0x2a
    };
    Aes  aes;
    byte ctA[16];
    byte ctB[16];
    byte rt[16];
    int  ret;
    int  i;

    ret = wc_Stm32_DhukRegister(WC_DHUK_DEVID);
    if (ret != 0) {
        printf("  DHUK register failed: %d\n", ret);
        return ret;
    }

