dgarske/wolfssl-examples-stm32/STM32_Bare_Test/src/main_dhuk.c
    /* Encrypt with seed A. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seedA, 32, NULL, AES_ENCRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesEcbEncrypt(&aes, ctA, pt, (word32)sizeof(pt));
    }
    wc_AesFree(&aes);
    if (is_expected_gated(ret)) {
        printf("  cryptocb ECB reachable; backend gated/unavailable (ret=%d)\n",
               ret);
        ret = 0; /* soft-PASS */
        goto cleanup;
    }
    if (ret != 0) {
        printf("  cryptocb ECB encrypt failed: %d\n", ret);
        goto cleanup;
    }
    if (XMEMCMP(pt, ctA, 16) == 0) {
        printf("  cryptocb ECB produced plaintext -- FAIL\n");
        ret = -1;
        goto cleanup;
    }
    printf("  cryptocb ECB ct:");
    for (i = 0; i < 16; i++) printf(" %02x", ctA[i]);
    printf("\n");

    /* Decrypt with seed A -- must recover plaintext. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seedA, 32, NULL, AES_DECRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesEcbDecrypt(&aes, rt, ctA, (word32)sizeof(ctA));
    }
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  cryptocb ECB decrypt failed: %d\n", ret);
        goto cleanup;
    }
    if (XMEMCMP(pt, rt, 16) != 0) {
        printf("  cryptocb ECB round-trip mismatch -- FAIL\n");
        ret = -1;
        goto cleanup;
    }
    printf("  cryptocb ECB round-trip OK\n");

    /* Encrypt with seed B -- different seed must give different ciphertext. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seedB, 32, NULL, AES_ENCRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesEcbEncrypt(&aes, ctB, pt, (word32)sizeof(pt));
    }
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  cryptocb ECB (seed B) failed: %d\n", ret);
        goto cleanup;
    }
    if (XMEMCMP(ctA, ctB, 16) == 0) {
        printf("  cryptocb ECB seed had no effect -- FAIL (not DHUK path)\n");
        ret = -1;
        goto cleanup;
    }
    printf("  cryptocb ECB seed-dependent OK (DHUK key drives cipher)\n");
    ret = 0;

cleanup:
    wc_Stm32_DhukUnRegister(WC_DHUK_DEVID);
    return ret;
}
#endif /* HAVE_AES_ECB || WOLFSSL_AES_DIRECT */

#if defined(HAVE_AES_CBC)
/* [5] Transparent AES-CBC via the STM32 DHUK device. Validates the fix that
 * routes CBC through the crypto-callback: previously CBC bypassed it and
 * silently used the 256-bit seed as a raw AES key. Discriminating check: for a
 * single block with IV = 0, CBC(P) == ECB(P) ONLY when both use the same
 * SAES-derived key -- the old seed-as-key path would not match ECB's derived
 * key. Also confirms that a DHUK AES-CTR call (a mode the SAES backend cannot
 * service) now returns a hard error instead of silently using the seed. */
static int test_dhuk_cryptocb_cbc(void)
{
    static const byte seedA[32] = {
        0x00,0x11,0x22,0x33,0x44,0x55,0x66,0x77,
        0x88,0x99,0xaa,0xbb,0xcc,0xdd,0xee,0xff,
        0x10,0x32,0x54,0x76,0x98,0xba,0xdc,0xfe,
        0xef,0xcd,0xab,0x89,0x67,0x45,0x23,0x01
    };
    static const byte pt[16] = {
        0x6b,0xc1,0xbe,0xe2,0x2e,0x40,0x9f,0x96,
        0xe9,0x3d,0x7e,0x11,0x73,0x93,0x17,0x2a
    };
    static const byte zero_iv[16] = { 0 };
    /* Two-block vector for the chained in-place decrypt regression below. */
    static const byte pt2[32] = {
        0x6b,0xc1,0xbe,0xe2,0x2e,0x40,0x9f,0x96,
        0xe9,0x3d,0x7e,0x11,0x73,0x93,0x17,0x2a,
        0xae,0x2d,0x8a,0x57,0x1e,0x03,0xac,0x9c,
        0x9e,0xb7,0x6f,0xac,0x45,0xaf,0x8e,0x51
    };
    Aes  aes;
    byte ctEcb[16];
    byte ctCbc[16];
    byte rt[16];
    byte buf2[32];
    int  ret;

    ret = wc_Stm32_DhukRegister(WC_DHUK_DEVID);
    if (ret != 0) {
        printf("  DHUK register failed: %d\n", ret);
        return ret;
    }

    /* ECB reference: ctEcb = ECB_k(pt) with the SAES-derived key. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seedA, 32, NULL, AES_ENCRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesEcbEncrypt(&aes, ctEcb, pt, (word32)sizeof(pt));
    }
    wc_AesFree(&aes);
    if (is_expected_gated(ret)) {
        printf("  cryptocb CBC reachable; backend gated/unavailable (ret=%d)\n",
               ret);
        ret = 0; /* soft-PASS */
        goto cleanup;
    }
    if (ret != 0) {
        printf("  ECB reference failed: %d\n", ret);
        goto cleanup;
    }

    /* CBC with IV = 0, single block: must equal the ECB reference. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seedA, 32, zero_iv, AES_ENCRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesCbcEncrypt(&aes, ctCbc, pt, (word32)sizeof(pt));
    }
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  cryptocb CBC encrypt failed: %d\n", ret);
        goto cleanup;
    }
    if (XMEMCMP(ctEcb, ctCbc, 16) != 0) {
        printf("  cryptocb CBC != ECB(IV=0) -- FAIL "
               "(CBC not using the SAES-derived key)\n");
        ret = -1;
        goto cleanup;
    }
    printf("  cryptocb CBC matches ECB(IV=0) OK (SAES-derived key drives CBC)\n");

    /* CBC round-trip: decrypt recovers plaintext. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seedA, 32, zero_iv, AES_DECRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesCbcDecrypt(&aes, rt, ctCbc, (word32)sizeof(ctCbc));
    }
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  cryptocb CBC decrypt failed: %d\n", ret);
        goto cleanup;
    }
    if (XMEMCMP(pt, rt, 16) != 0) {
        printf("  cryptocb CBC round-trip mismatch -- FAIL\n");
        ret = -1;
        goto cleanup;
    }
    printf("  cryptocb CBC round-trip OK\n");

    /* Multi-block chained in-place CBC decrypt (regression for the chaining-IV
     * fix). Split a two-block ciphertext across two in-place wc_AesCbcDecrypt
     * calls so the second call depends on the chaining IV (aes->reg) that the
     * first call must update. In-place decrypt overwrites the input block with
     * plaintext, so the wrapper has to save the ciphertext block for the next
     * IV; reading it back from the overwritten input corrupts block 1. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seedA, 32, zero_iv, AES_ENCRYPTION);
    }
    if (ret == 0) {
        /* Encrypt straight into buf2; it is decrypted in place below. */
        ret = wc_AesCbcEncrypt(&aes, buf2, pt2, (word32)sizeof(pt2));
    }
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  cryptocb CBC 2-block encrypt failed: %d\n", ret);
        goto cleanup;
    }
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seedA, 32, zero_iv, AES_DECRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesCbcDecrypt(&aes, buf2, buf2, 16);         /* block 0 */
    }
    if (ret == 0) {
        ret = wc_AesCbcDecrypt(&aes, buf2 + 16, buf2 + 16, 16); /* block 1 */
    }
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  cryptocb CBC chained in-place decrypt failed: %d\n", ret);
        goto cleanup;
    }
    if (XMEMCMP(pt2, buf2, sizeof(pt2)) != 0) {
        printf("  cryptocb CBC chained in-place decrypt mismatch -- FAIL "
               "(chaining IV corrupted)\n");
        ret = -1;
        goto cleanup;
    }
    printf("  cryptocb CBC chained in-place decrypt OK\n");

#ifdef WOLFSSL_AES_COUNTER
    /* Negative: AES-CTR is not serviceable for a DHUK key. It must now return a
     * hard error (ALGO_ID_E) rather than silently encrypting with the seed as a
     * raw key. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seedA, 32, zero_iv, AES_ENCRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesCtrEncrypt(&aes, rt, pt, (word32)sizeof(pt));
    }
    wc_AesFree(&aes);
    if (ret == ALGO_ID_E) {
        printf("  cryptocb CTR on DHUK key rejected (ALGO_ID_E) OK\n");
        ret = 0;
    }
    else {
        printf("  cryptocb CTR on DHUK key NOT rejected (ret=%d) -- FAIL\n", ret);
        ret = -1;
        goto cleanup;
    }
#endif /* WOLFSSL_AES_COUNTER */
    ret = 0;

cleanup:
    wc_Stm32_DhukUnRegister(WC_DHUK_DEVID);
    return ret;
}
#endif /* HAVE_AES_CBC */

/* [6] wc_Stm32_Aes_Wrap blob word order. Runs on BOTH build paths so the two
 * can be compared: WC_STM32_WRAP_ORDER_RAW must produce the same blob on
 * bare-metal and CubeMX/HAL (that is the whole point of the shared format),
 * while wc_Stm32_Aes_Wrap()'s default is deliberately per-build -- raw on
 * bare, byte-reversed on CubeMX -- so key material provisioned by wolfSSL
 * 5.9.0 - 5.9.2 still unwraps. Both blobs are printed so a bare run and a
 * CubeMX run can be diffed by eye or by script.
 *
 * The wrap key here is a fixed software key (devId != WOLFSSL_DHUK_DEVID), not
 * the silicon DHUK, so the output is reproducible across chips and the check
 * is about byte order only. */
static int test_dhuk_wrap_order(void)
{
    /* AES-128 FIPS-197 key, and a 32-byte payload to wrap. */
    static const byte wrap_key[32] = {
        0x60,0x3d,0xeb,0x10,0x15,0xca,0x71,0xbe,
        0x2b,0x73,0xae,0xf0,0x85,0x7d,0x77,0x81,
        0x1f,0x35,0x2c,0x07,0x3b,0x61,0x08,0xd7,
        0x2d,0x98,0x10,0xa3,0x09,0x14,0xdf,0xf4
    };
    static const byte payload[32] = {
        0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
        0x08,0x09,0x0a,0x0b,0x0c,0x0d,0x0e,0x0f,
        0x10,0x11,0x12,0x13,0x14,0x15,0x16,0x17,
        0x18,0x19,0x1a,0x1b,0x1c,0x1d,0x1e,0x1f
    };
    Aes    aes;
    byte   rawBlob[32];
    byte   defBlob[32];
    word32 rawSz = sizeof(rawBlob);
    word32 defSz = sizeof(defBlob);
    word32 i;
    int    ret;

    XMEMSET(rawBlob, 0, sizeof(rawBlob));
    XMEMSET(defBlob, 0, sizeof(defBlob));

    /* Shared raw order -- must match byte-for-byte on both build paths. */
    ret = wc_AesInit(&aes, NULL, INVALID_DEVID);
    if (ret != 0) {
        printf("  wc_AesInit failed: %d\n", ret);
        return ret;
    }
    XMEMCPY(aes.key, wrap_key, sizeof(wrap_key));
    aes.keylen = 32;
    ret = wc_Stm32_Aes_Wrap_ex(&aes, payload, sizeof(payload), rawBlob, &rawSz,
                               NULL, 0, WC_STM32_WRAP_ORDER_RAW);
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  wrap_ex(RAW) failed: %d\n", ret);
        return ret;
    }

    /* Whatever this build's wc_Stm32_Aes_Wrap() defaults to. */
    ret = wc_AesInit(&aes, NULL, INVALID_DEVID);
    if (ret != 0) {
        printf("  wc_AesInit failed: %d\n", ret);
        return ret;
    }
    XMEMCPY(aes.key, wrap_key, sizeof(wrap_key));
    aes.keylen = 32;
    ret = wc_Stm32_Aes_Wrap(&aes, payload, sizeof(payload), defBlob, &defSz,
                            NULL, 0);
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  wrap(default) failed: %d\n", ret);
        return ret;
    }

    if (rawSz != sizeof(rawBlob) || defSz != sizeof(defBlob)) {
        printf("  wrap returned wrong size (raw=%lu def=%lu) -- FAIL\n",
               (unsigned long)rawSz, (unsigned long)defSz);
        return -1;
    }

    printf("  wrap RAW blob:    ");
    for (i = 0; i < sizeof(rawBlob); i++) printf("%02x", rawBlob[i]);
    printf("\n  wrap default blob:");
    for (i = 0; i < sizeof(defBlob); i++) printf("%02x", defBlob[i]);
    printf("\n");

    /* Both build paths now default to the raw order, so the plain wrap must
     * match wrap_ex(RAW). Legacy stays reachable through _ex() only. */
    if (XMEMCMP(rawBlob, defBlob, sizeof(rawBlob)) != 0) {
        printf("  default order differs from RAW -- FAIL\n");
        return -1;
    }
    printf("  default order is RAW on this build OK\n");
    printf("  compare the RAW line against the other build to confirm "
           "cross-build interop\n");
    return 0;
}

#if defined(HAVE_ECC) && defined(WOLFSSL_STM32_PKA)
/* [4] ECDSA sign with a DHUK-protected private key via the normal
 * wc_ecc_sign_hash API. Self-bootstrap: make a P-256 keypair, ECB-encrypt
 * (wrap) its scalar with the DHUK-derived key (same seed), import the wrapped
 * scalar + seed onto the ecc_key, set devId = WC_DHUK_DEVID, then sign. The
 * plaintext scalar only lives in a short-lived stack buffer during the PKA
 * sign. The signature is verified with the public counterpart (SW path). */
static int test_dhuk_cryptocb_ecdsa(WC_RNG* rng)
{
    static const byte seed[32] = {
        0x00,0x11,0x22,0x33,0x44,0x55,0x66,0x77,
        0x88,0x99,0xaa,0xbb,0xcc,0xdd,0xee,0xff,
        0x10,0x32,0x54,0x76,0x98,0xba,0xdc,0xfe,
        0xef,0xcd,0xab,0x89,0x67,0x45,0x23,0x01
    };
    static const byte hash[32] = {
        0x9f,0x86,0xd0,0x81,0x88,0x4c,0x7d,0x65,
        0x9a,0x2f,0xea,0xa0,0xc5,0x5a,0xd0,0x15,
        0xa3,0xbf,0x4f,0x1b,0x2b,0x0b,0x82,0x2c,
        0xd1,0x5d,0x6c,0x15,0xb0,0xf0,0x0a,0x08
    };
    ecc_key kp;
    Aes  aes;
    byte priv[32];
    byte wrapped[32];
    byte sig[80];
    word32 privSz = (word32)sizeof(priv);
    word32 sigLen = (word32)sizeof(sig);
    int  ret;
    int  verify = 0;
    int  haveKey = 0;

    ret = wc_Stm32_DhukRegister(WC_DHUK_DEVID);
    if (ret != 0) {
        printf("  DHUK register failed: %d\n", ret);
        return ret;
    }

    ret = wc_ecc_init(&kp);
    if (ret != 0) {
        printf("  wc_ecc_init failed: %d\n", ret);
        goto unreg;
    }
    haveKey = 1;
    ret = wc_ecc_make_key_ex(rng, 32, &kp, ECC_SECP256R1);
    if (ret != 0) {
        printf("  wc_ecc_make_key_ex failed: %d\n", ret);
        goto cleanup;
    }

    /* Sanity: plain (non-DHUK) PKA ECDSA sign+verify on this silicon, to
     * isolate any DHUK-path issue from a PKA-hardware issue. kp.devId is
     * still INVALID here, so this uses the normal HW PKA path. */
    sigLen = (word32)sizeof(sig);
    ret = wc_ecc_sign_hash(hash, (word32)sizeof(hash), sig, &sigLen, rng, &kp);
    if (ret == 0) {
        ret = wc_ecc_verify_hash(sig, sigLen, hash, (word32)sizeof(hash),
                                 &verify, &kp);
    }
    printf("  plain PKA sign+verify: rc=%d verify=%d\n", ret, verify);
    ret = 0;
    verify = 0;
    sigLen = (word32)sizeof(sig);

    ret = wc_ecc_export_private_only(&kp, priv, &privSz);
    if (ret != 0 || privSz != 32u) {
        printf("  export scalar failed: %d (len %lu)\n", ret,
               (unsigned long)privSz);
        ret = (ret != 0) ? ret : -1;
        goto cleanup;
    }

    /* Wrap the scalar = ECB-encrypt with the DHUK-derived key (seed as key). */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seed, 32, NULL, AES_ENCRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesEcbEncrypt(&aes, wrapped, priv, 32);
    }
    wc_AesFree(&aes);
    wc_ForceZero(priv, sizeof(priv));
    if (is_expected_gated(ret)) {
        printf("  DHUK ECDSA: backend gated/unavailable (ret=%d)\n", ret);
        ret = 0; /* soft-PASS */
        goto cleanup;
    }
    if (ret != 0) {
        printf("  scalar wrap failed: %d\n", ret);
        goto cleanup;
    }

