dgarske/wolfssl-examples-stm32/STM32_Bare_Test/src/main_dhuk.c
    /* Import the wrapped scalar + seed, and route signing through DHUK by
     * setting the device id on the key. */
    kp.devId = WC_DHUK_DEVID;
    ret = wc_ecc_import_wrapped_private(&kp, ECC_SECP256R1, seed,
                                        (word32)sizeof(seed),
                                       wrapped, 32, 32);
    if (ret != 0) {
        printf("  import wrapped private failed: %d\n", ret);
        goto cleanup;
    }

    ret = wc_ecc_sign_hash(hash, (word32)sizeof(hash), sig, &sigLen, rng, &kp);
    if (is_expected_gated(ret)) {
        printf("  DHUK ECDSA sign gated/unavailable (ret=%d)\n", ret);
        ret = 0; /* soft-PASS */
        goto cleanup;
    }
    if (ret != 0) {
        printf("  DHUK ECDSA sign failed: %d\n", ret);
        goto cleanup;
    }
    printf("  DHUK ECDSA sign produced a %lu-byte signature\n",
           (unsigned long)sigLen);

    /* Verify with the public counterpart (crypto-cb has no verify -> SW). */
    ret = wc_ecc_verify_hash(sig, sigLen, hash, (word32)sizeof(hash),
                             &verify, &kp);
    if (ret != 0) {
        printf("  DHUK ECDSA verify error: %d\n", ret);
        goto cleanup;
    }
    if (verify != 1) {
        printf("  DHUK ECDSA verify FAILED (sig invalid)\n");
        ret = -1;
        goto cleanup;
    }
    printf("  DHUK ECDSA verify OK (signed via DHUK, verified with pubkey)\n");
    ret = 0;

cleanup:
    wc_ForceZero(priv, sizeof(priv));
    wc_ForceZero(wrapped, sizeof(wrapped));
    if (haveKey) {
        wc_ecc_free(&kp);
    }
unreg:
    wc_Stm32_DhukUnRegister(WC_DHUK_DEVID);
    return ret;
}
#endif /* HAVE_ECC && WOLFSSL_STM32_PKA */

#if (defined(HAVE_AES_ECB) || defined(WOLFSSL_AES_DIRECT)) && \
    defined(HAVE_AES_CBC)
/* [8] Provisioning reference -- the minimal shape a product uses, kept
 * deliberately free of the probing and cross-checking the tests above do.
 *
 * The one thing to understand before reading it: the SAES/DHUK block does
 * not wrap and unwrap a key you choose. It derives. A 256-bit seed plus the
 * silicon DHUK produce a working key inside SAES KEYR that never enters
 * software, and nothing hands that key back. So there is no call that
 * returns your original AES key -- see the wc_Stm32_Aes_DhukOp comment in
 * wolfssl/wolfcrypt/port/st/stm32.h ("NOT the inverse of
 * wc_Stm32_Aes_Wrap"). Three flows follow from that:
 *
 *   A -- Data encryption with a DHUK-protected key. Do not pick the key at
 *        all: store 32 random bytes as the seed and let the hardware derive
 *        the key on every use. Key material never exists in software, and
 *        the ciphertext is readable only on this die. Prefer this.
 *   B -- An externally supplied AES-256 key K that must be used verbatim
 *        (interop). The DHUK-derived key becomes a KEK: encrypt K under it
 *        at provisioning, decrypt K back at runtime, and run K on the
 *        plaintext-key AES device. K exists in RAM while in use -- the cost
 *        of interop.
 *   C -- ECDSA with a DHUK-protected private key. The scalar is wrapped the
 *        same way K is in B, then handed to the ecc_key; wc_ecc_sign_hash()
 *        is the ordinary API from there.
 *
 * In a real product, the wrapping half of B and C happens once in the
 * factory and only the blob plus the seed reach flash. Both halves run here
 * so the example is self-contained. */
static int dhuk_provision_example(WC_RNG* rng)
{
    /* What a product would keep in flash. */
    static byte seed[32];       /* per-key derivation seed -- not secret     */
    static byte wrappedKey[32]; /* flow B: K encrypted under the derived key */
    static byte wrappedPriv[32];/* flow C: ECC scalar, same treatment        */

    static const byte pt[32] = {
        0x6b,0xc1,0xbe,0xe2,0x2e,0x40,0x9f,0x96,
        0xe9,0x3d,0x7e,0x11,0x73,0x93,0x17,0x2a,
        0xae,0x2d,0x8a,0x57,0x1e,0x03,0xac,0x9c,
        0x9e,0xb7,0x6f,0xac,0x45,0xaf,0x8e,0x51
    };
    /* CBC needs a fresh unpredictable IV per encryption; it is not secret and
     * is stored or transmitted alongside the ciphertext. Generated here rather
     * than hard-coded so this reads as the production pattern. */
    byte iv[16];
    /* Flow B only: a key the application does not get to choose. */
    static const byte extKey[32] = {
        0x60,0x3d,0xeb,0x10,0x15,0xca,0x71,0xbe,
        0x2b,0x73,0xae,0xf0,0x85,0x7d,0x77,0x81,
        0x1f,0x35,0x2c,0x07,0x3b,0x61,0x08,0xd7,
        0x2d,0x98,0x10,0xa3,0x09,0x14,0xdf,0xf4
    };
    Aes    aes;
    byte   ct[32];
    byte   rt[32];
    byte   recovered[32];
    int    ret;
    int    dhukReg = 0;
    int    aesReg = 0;

    XMEMSET(ct, 0, sizeof(ct));
    XMEMSET(rt, 0, sizeof(rt));
    XMEMSET(recovered, 0, sizeof(recovered));

    /* One-time: make the DHUK device available at WC_DHUK_DEVID. */
    ret = wc_Stm32_DhukRegister(WC_DHUK_DEVID);
    if (ret != 0) {
        printf("  wc_Stm32_DhukRegister failed: %d\n", ret);
        return ret;
    }
    dhukReg = 1;

    /* Provisioning step 0: the seed is just random bytes. It is stored in
     * the clear -- it is worthless on any other chip, because the key it
     * derives depends on this die's DHUK. */
    ret = wc_RNG_GenerateBlock(rng, iv, sizeof(iv));
    if (ret != 0) {
        printf("  wc_RNG_GenerateBlock(iv) failed: %d\n", ret);
        goto cleanup;
    }
    ret = wc_RNG_GenerateBlock(rng, seed, sizeof(seed));
    if (ret != 0) {
        printf("  seed generation failed: %d\n", ret);
        goto cleanup;
    }

    /* ---- A: encrypt with a DHUK-derived key (no wrapping involved) ----
     * The 32 bytes handed to wc_AesSetKey are the SEED, not a literal key:
     * a WC_DHUK_DEVID Aes always treats a 256-bit key that way. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seed, sizeof(seed), iv, AES_ENCRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesCbcEncrypt(&aes, ct, pt, (word32)sizeof(pt));
    }
    wc_AesFree(&aes);
    if (is_expected_gated(ret)) {
        printf("  DHUK backend gated/unavailable (ret=%d) -- skipping\n", ret);
        ret = 0; /* soft-PASS */
        goto cleanup;
    }
    if (ret != 0) {
        printf("  [A] DHUK CBC encrypt failed: %d\n", ret);
        goto cleanup;
    }

