dgarske/wolfssl-examples-stm32/STM32_Bare_Test/src/main_dhuk.c
    /* Decrypting is the same call with the same seed. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seed, sizeof(seed), iv, AES_DECRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesCbcDecrypt(&aes, rt, ct, (word32)sizeof(ct));
    }
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  [A] DHUK CBC decrypt failed: %d\n", ret);
        goto cleanup;
    }
    if (XMEMCMP(rt, pt, sizeof(pt)) != 0) {
        printf("  [A] DHUK CBC round-trip mismatch -- FAIL\n");
        ret = -1;
        goto cleanup;
    }
    printf("  [A] seed-keyed AES-CBC round-trip OK "
           "(key derived in HW, never in SW)\n");

    /* ---- B: protect an externally supplied AES-256 key ----
     * Factory half: encrypt K with the DHUK-derived key. AES-ECB is the
     * right mode here because the payload is exactly one key's worth of
     * high-entropy bytes, and it is what flow C's unwrap expects too. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seed, sizeof(seed), NULL, AES_ENCRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesEcbEncrypt(&aes, wrappedKey, extKey,
                               (word32)sizeof(extKey));
    }
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  [B] key wrap failed: %d\n", ret);
        goto cleanup;
    }
    /* wrappedKey + seed go to flash; the clear K is discarded. */

    /* Runtime half: recover K, then run it as an ordinary key on the
     * plaintext-key AES device -- a different device from the DHUK one,
     * selected per Aes by devId. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seed, sizeof(seed), NULL, AES_DECRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesEcbDecrypt(&aes, recovered, wrappedKey,
                               (word32)sizeof(wrappedKey));
    }
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  [B] key unwrap failed: %d\n", ret);
        goto cleanup;
    }
    if (XMEMCMP(recovered, extKey, sizeof(extKey)) != 0) {
        printf("  [B] unwrapped key != K -- FAIL\n");
        ret = -1;
        goto cleanup;
    }

    ret = wc_Stm32_AesRegister(WOLFSSL_STM32_AES_DEVID);
    if (ret != 0) {
        printf("  wc_Stm32_AesRegister failed: %d\n", ret);
        goto cleanup;
    }
    aesReg = 1;

    XMEMSET(ct, 0, sizeof(ct));
    ret = wc_AesInit(&aes, NULL, WOLFSSL_STM32_AES_DEVID);
    if (ret == 0) {
        /* Used verbatim on this devId -- no derivation. */
        ret = wc_AesSetKey(&aes, recovered, sizeof(recovered), NULL,
                           AES_ENCRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesEcbEncrypt(&aes, ct, pt, (word32)sizeof(pt));
    }
    wc_AesFree(&aes);
    wc_ForceZero(recovered, sizeof(recovered));
    if (ret != 0) {
        printf("  [B] plaintext-key AES failed: %d\n", ret);
        goto cleanup;
    }
    printf("  [B] external AES-256 key wrapped under DHUK and used OK "
           "(K in RAM only while in use)\n");

#if defined(HAVE_ECC) && defined(WOLFSSL_STM32_PKA)
    /* ---- C: ECDSA sign with a DHUK-protected private key ---- */
    {
        static const byte hash[32] = {
            0x9f,0x86,0xd0,0x81,0x88,0x4c,0x7d,0x65,
            0x9a,0x2f,0xea,0xa0,0xc5,0x5a,0xd0,0x15,
            0xa3,0xbf,0x4f,0x1b,0x2b,0x0b,0x82,0x2c,
            0xd1,0x5d,0x6c,0x15,0xb0,0xf0,0x0a,0x08
        };
        ecc_key key;
        byte    priv[32];
        byte    sig[80];
        word32  privSz = (word32)sizeof(priv);
        word32  sigLen = (word32)sizeof(sig);
        int     verify = 0;
        int     haveKey = 0;

        ret = wc_ecc_init(&key);
        if (ret != 0) {
            printf("  [C] wc_ecc_init failed: %d\n", ret);
            goto cleanup;
        }
        haveKey = 1;

        /* Factory half: generate the key pair, wrap its scalar with the
         * same DHUK-derived key flow B used, and forget the clear scalar. */
        ret = wc_ecc_make_key_ex(rng, 32, &key, ECC_SECP256R1);
        if (ret == 0) {
            ret = wc_ecc_export_private_only(&key, priv, &privSz);
        }
        if (ret == 0 && privSz != 32u) {
            ret = -1;
        }
        if (ret == 0) {
            ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
            if (ret == 0) {
                ret = wc_AesSetKey(&aes, seed, sizeof(seed), NULL,
                                   AES_ENCRYPTION);
                if (ret == 0) {
                    ret = wc_AesEcbEncrypt(&aes, wrappedPriv, priv, 32);
                }
                wc_AesFree(&aes);
            }
        }
        wc_ForceZero(priv, sizeof(priv));
        if (ret != 0) {
            printf("  [C] scalar wrap failed: %d\n", ret);
            goto eccCleanup;
        }
        /* wrappedPriv + seed + the public key go to flash. */

        /* Runtime half: point the key at the DHUK device, hand it the blob
         * and the seed, then sign with the ordinary API. The scalar is
         * unwrapped into a short-lived buffer for the PKA and scrubbed --
         * on U3 the CCB path (WOLFSSL_STM32_CCB) keeps it out of software
         * entirely. */
        key.devId = WC_DHUK_DEVID;
        ret = wc_ecc_import_wrapped_private(&key, ECC_SECP256R1, seed,
                                            (word32)sizeof(seed),
                                            wrappedPriv, 32, 32);
        if (ret == 0) {
            ret = wc_ecc_sign_hash(hash, (word32)sizeof(hash), sig, &sigLen,
                                   rng, &key);
        }
        if (ret != 0) {
            printf("  [C] DHUK ECDSA sign failed: %d\n", ret);
            goto eccCleanup;
        }

        /* Verify is unchanged -- it uses the in-clear public counterpart. */
        ret = wc_ecc_verify_hash(sig, sigLen, hash, (word32)sizeof(hash),
                                 &verify, &key);
        if (ret != 0) {
            printf("  [C] DHUK ECDSA verify error: %d\n", ret);
            goto eccCleanup;
        }
        if (verify != 1) {
            printf("  [C] DHUK ECDSA verify FAILED (sig invalid)\n");
            ret = -1;
            goto eccCleanup;
        }
        printf("  [C] ECDSA signed with a DHUK-wrapped scalar, "
               "verified with the public key\n");

