dgarske/wolfssl-examples-stm32/STM32_Bare_Test/src/main_dhuk.c
    eccCleanup:
        if (haveKey) {
            wc_ecc_free(&key);
        }
        if (ret != 0) {
            goto cleanup;
        }
    }
#endif /* HAVE_ECC && WOLFSSL_STM32_PKA */

cleanup:
    wc_ForceZero(recovered, sizeof(recovered));
    if (aesReg) {
        wc_Stm32_AesUnRegister(WOLFSSL_STM32_AES_DEVID);
    }
    if (dhukReg) {
        wc_Stm32_DhukUnRegister(WC_DHUK_DEVID);
    }
    return ret;
}
#endif /* (HAVE_AES_ECB || WOLFSSL_AES_DIRECT) && HAVE_AES_CBC */
#endif /* WOLF_CRYPTO_CB */


/* Shared hex dump for the blob/ciphertext comparisons below. */
static void dhuk_print_hex(const char* label, const byte* p, word32 sz)
{
    word32 i;
    printf("  %s:", label);
    for (i = 0; i < sz; i++) {
        printf(" %02x", p[i]);
    }
    printf("\n");
}

#if defined(WOLF_CRYPTO_CB) && \
    (defined(HAVE_AES_ECB) || defined(WOLFSSL_AES_DIRECT))

/* Runtime half of the pattern under test: treat `blob` as the key on a
 * WC_DHUK_DEVID Aes and decrypt one block. Sets *isK when the recovered
 * plaintext equals the original, i.e. when the hardware really did put the
 * wrapped key back into KEYR. */
static int dhuk_try_blob_as_key(const byte* blob, const byte* enc,
    const byte* ptOrig, byte* dec, int* isK)
{
    Aes aes;
    int ret;

    *isK = 0;
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret != 0) {
        return ret;
    }
    ret = wc_AesSetKey(&aes, blob, 32, NULL, AES_DECRYPTION);
    if (ret == 0) {
        ret = wc_AesEcbDecrypt(&aes, dec, enc, WC_AES_BLOCK_SIZE);
    }
    wc_AesFree(&aes);
    if (ret == 0 && XMEMCMP(dec, ptOrig, WC_AES_BLOCK_SIZE) == 0) {
        *isK = 1;
    }
    return ret;
}

/* [9] A wc_Stm32_Aes_Wrap() blob must unwrap back to the key it wrapped.
 *
 * This reproduces an integration pattern that customers arrive at on their
 * own, because it is the obvious reading of the API: wrap an externally
 * supplied AES-256 key K with wc_Stm32_Aes_Wrap() at provisioning, store the
 * blob in flash, then at runtime hand the blob to wc_AesSetKey() on a
 * WC_DHUK_DEVID Aes and expect the hardware to unwrap it so that an ordinary
 * wc_AesEcbDecrypt() runs under K.
 *
 * It does not work, and -- the part that costs debugging days -- it fails
 * silently, with every call returning 0. The DHUK crypto-callback device
 * treats ANY 256-bit key as a derivation SEED; the discriminator is just
 * aes->keylen == 32 (Stm32Dhuk_AesSeed in wolfcrypt/src/port/st/stm32.c).
 * So it computes KEK = DHUK-decrypt(blob) into KEYR and deciphers with the
 * KEK instead of with K. The application sees wrong plaintext, not an error.
 *
 * Both blob word orders are tried. wc_Stm32_Aes_Wrap() defaults to
 * WC_STM32_WRAP_ORDER_LEGACY on the CubeMX build while every consumer of a
 * blob expects WC_STM32_WRAP_ORDER_RAW, so a word-order mismatch is an
 * independent reason for the same symptom and the two have to be told apart.
 *
 * The KEK pattern that does work is asserted at the end for contrast. It is
 * what [8] flow B does, and it is the shape integrators should copy. */
static int test_dhuk_wrap_as_key(void)
{
    /* The externally supplied key the application must use verbatim
     * (FIPS-197 AES-256), and one NIST SP 800-38A plaintext block. */
    static const byte extKey[32] = {
        0x60,0x3d,0xeb,0x10,0x15,0xca,0x71,0xbe,
        0x2b,0x73,0xae,0xf0,0x85,0x7d,0x77,0x81,
        0x1f,0x35,0x2c,0x07,0x3b,0x61,0x08,0xd7,
        0x2d,0x98,0x10,0xa3,0x09,0x14,0xdf,0xf4
    };
    static const byte ptOrig[WC_AES_BLOCK_SIZE] = {
        0x6b,0xc1,0xbe,0xe2,0x2e,0x40,0x9f,0x96,
        0xe9,0x3d,0x7e,0x11,0x73,0x93,0x17,0x2a
    };
    /* Per-key derivation seed for the KEK contrast. Not secret. */
    static const byte seed[32] = {
        0x00,0x11,0x22,0x33,0x44,0x55,0x66,0x77,
        0x88,0x99,0xaa,0xbb,0xcc,0xdd,0xee,0xff,
        0x10,0x32,0x54,0x76,0x98,0xba,0xdc,0xfe,
        0xef,0xcd,0xab,0x89,0x67,0x45,0x23,0x01
    };
    Aes    aes;
    byte   enc[WC_AES_BLOCK_SIZE];
    byte   dec[WC_AES_BLOCK_SIZE];
    byte   blobDef[32];
    byte   blobRaw[32];
    byte   kekBlob[32];
    byte   recovered[32];
    word32 blobDefSz = (word32)sizeof(blobDef);
    word32 blobRawSz = (word32)sizeof(blobRaw);
    int    dhukReg = 0;
    int    aesReg  = 0;
    int    defIsK  = 0;
    int    rawIsK  = 0;
    int    ret;

    XMEMSET(enc,       0, sizeof(enc));
    XMEMSET(dec,       0, sizeof(dec));
    XMEMSET(blobDef,   0, sizeof(blobDef));
    XMEMSET(blobRaw,   0, sizeof(blobRaw));
    XMEMSET(kekBlob,   0, sizeof(kekBlob));
    XMEMSET(recovered, 0, sizeof(recovered));

    /* The ciphertext the key-install process supplies: a true AES-256-ECB of
     * ptOrig under K, computed here on the ordinary (non-DHUK) engine. */
    ret = wc_AesInit(&aes, NULL, INVALID_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, extKey, (word32)sizeof(extKey), NULL,
                           AES_ENCRYPTION);
        if (ret == 0) {
            ret = wc_AesEcbEncrypt(&aes, enc, ptOrig, (word32)sizeof(ptOrig));
        }
        wc_AesFree(&aes);
    }
    if (ret != 0) {
        printf("  reference AES-256-ECB under K failed: %d\n", ret);
        return ret;
    }
    dhuk_print_hex("reference enc = AES-ECB(K, pt)", enc, sizeof(enc));

    ret = wc_Stm32_DhukRegister(WC_DHUK_DEVID);
    if (ret != 0) {
        printf("  wc_Stm32_DhukRegister failed: %d\n", ret);
        return ret;
    }
    dhukReg = 1;

    /* Provisioning half, exactly as an integrator writes it: wrap K under the
     * silicon DHUK. The two spellings are deliberate and both are 808:
     * wc_Stm32_Aes_Wrap() reads aes->devId as a wrap-key-source marker and
     * wants WOLFSSL_DHUK_DEVID for KEYSEL=HW, while the crypto-callback
     * device is registered at WC_DHUK_DEVID above. */
    ret = wc_AesInit(&aes, NULL, WOLFSSL_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_Stm32_Aes_Wrap(&aes, extKey, (word32)sizeof(extKey),
                                blobDef, &blobDefSz, NULL, 0);
        wc_AesFree(&aes);
    }
    if (is_expected_gated(ret)) {
        printf("  wc_Stm32_Aes_Wrap gated on this silicon (%d) -- skipping\n",
               ret);
        ret = 0;
        goto cleanup;
    }
    if (ret != 0) {
        printf("  wc_Stm32_Aes_Wrap (default order) failed: %d\n", ret);
        goto cleanup;
    }

    ret = wc_AesInit(&aes, NULL, WOLFSSL_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_Stm32_Aes_Wrap_ex(&aes, extKey, (word32)sizeof(extKey),
                                   blobRaw, &blobRawSz, NULL, 0,
                                   WC_STM32_WRAP_ORDER_RAW);
        wc_AesFree(&aes);
    }
    if (is_expected_gated(ret)) {
        printf("  wc_Stm32_Aes_Wrap_ex(RAW) gated on this silicon (%d) -- "
               "skipping\n", ret);
        ret = 0;
        goto cleanup;
    }
    if (ret != 0) {
        printf("  wc_Stm32_Aes_Wrap_ex(RAW) failed: %d\n", ret);
        goto cleanup;
    }

