dgarske/wolfssl-examples-stm32/STM32_Bare_Test/src/main_dhuk.c
    /* Use the sizes the API reported, not the buffer sizes, so a short write
     * cannot be printed as trailing garbage or used as a 32-byte key. */
    if (blobDefSz != sizeof(blobDef) || blobRawSz != sizeof(blobRaw)) {
        printf("  wrap returned unexpected size (def=%lu raw=%lu, want %lu) "
               "-- FAIL\n", (unsigned long)blobDefSz, (unsigned long)blobRawSz,
               (unsigned long)sizeof(blobDef));
        ret = -1;
        goto cleanup;
    }

    dhuk_print_hex("blob (this build's default order)", blobDef, blobDefSz);
    dhuk_print_hex("blob (WC_STM32_WRAP_ORDER_RAW)   ", blobRaw, blobRawSz);

    /* Runtime half: hand each blob to the DHUK device as if it were a key. */
    ret = dhuk_try_blob_as_key(blobDef, enc, ptOrig, dec, &defIsK);
    if (is_expected_gated(ret)) {
        printf("  blob-as-key (default order) gated on this silicon "
               "(%d) -- skipping\n", ret);
        ret = 0;
        goto cleanup;
    }
    if (ret != 0) {
        printf("  blob-as-key (default order) returned %d\n", ret);
        goto cleanup;
    }
    printf("  blob-as-key, default order: rc=0, plaintext %s\n",
           defIsK ? "MATCHES pt_orig" : "does NOT match pt_orig");
    dhuk_print_hex("  got", dec, sizeof(dec));

    ret = dhuk_try_blob_as_key(blobRaw, enc, ptOrig, dec, &rawIsK);
    if (is_expected_gated(ret)) {
        printf("  blob-as-key (RAW order) gated on this silicon "
               "(%d) -- skipping\n", ret);
        ret = 0;
        goto cleanup;
    }
    if (ret != 0) {
        printf("  blob-as-key (RAW order) returned %d\n", ret);
        goto cleanup;
    }
    printf("  blob-as-key, RAW order:     rc=0, plaintext %s\n",
           rawIsK ? "MATCHES pt_orig" : "does NOT match pt_orig");
    dhuk_print_hex("  got", dec, sizeof(dec));

    /* The RAW blob must round-trip: wc_Stm32_Aes_Wrap is the inverse of the
     * SAES wrapped-key load, so handing the blob back as the key recovers K.
     * Regression guard for the unwrap fix (SR.BUSY must be waited out after
     * KEYSEL=HW latches, and the key path runs with CR.DATATYPE = 00). */
    if (!rawIsK) {
        printf("  RAW blob did not unwrap back to K -- FAIL\n");
        ret = -1;
        goto cleanup;
    }
    printf("  RAW blob unwrapped back to K OK (wrap/unwrap are inverses)\n");
    /* The plain wrap now defaults to RAW on both build paths, so the default
     * blob must round-trip too. */
    if (!defIsK) {
        printf("  default-order blob did not unwrap back to K -- FAIL\n");
        ret = -1;
        goto cleanup;
    }

    /* Contrast: the KEK pattern, which does round-trip. Provision by
     * ECB-encrypting K under the seed-derived key; recover it at runtime with
     * the same seed; then run K verbatim on the plaintext-key device. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seed, (word32)sizeof(seed), NULL,
                           AES_ENCRYPTION);
        if (ret == 0) {
            ret = wc_AesEcbEncrypt(&aes, kekBlob, extKey,
                                   (word32)sizeof(extKey));
        }
        wc_AesFree(&aes);
    }
    if (ret != 0) {
        printf("  KEK wrap of K failed: %d\n", ret);
        goto cleanup;
    }

    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seed, (word32)sizeof(seed), NULL,
                           AES_DECRYPTION);
        if (ret == 0) {
            ret = wc_AesEcbDecrypt(&aes, recovered, kekBlob,
                                   (word32)sizeof(kekBlob));
        }
        wc_AesFree(&aes);
    }
    if (ret != 0) {
        printf("  KEK unwrap of K failed: %d\n", ret);
        goto cleanup;
    }
    if (XMEMCMP(recovered, extKey, sizeof(extKey)) != 0) {
        printf("  KEK unwrap did not recover K -- FAIL\n");
        ret = -1;
        goto cleanup;
    }
    printf("  KEK round-trip recovered K OK\n");

    ret = wc_Stm32_AesRegister(WOLFSSL_STM32_AES_DEVID);
    if (ret != 0) {
        printf("  wc_Stm32_AesRegister failed: %d\n", ret);
        goto cleanup;
    }
    aesReg = 1;

    XMEMSET(dec, 0, sizeof(dec));
    ret = wc_AesInit(&aes, NULL, WOLFSSL_STM32_AES_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, recovered, (word32)sizeof(recovered), NULL,
                           AES_DECRYPTION);
        if (ret == 0) {
            ret = wc_AesEcbDecrypt(&aes, dec, enc, (word32)sizeof(enc));
        }
        wc_AesFree(&aes);
    }
    if (ret != 0) {
        printf("  plaintext-key decrypt failed: %d\n", ret);
        goto cleanup;
    }
    if (XMEMCMP(dec, ptOrig, sizeof(ptOrig)) != 0) {
        printf("  plaintext-key decrypt did not recover pt_orig -- FAIL\n");
        ret = -1;
        goto cleanup;
    }
    printf("  KEK pattern decrypted enc back to pt_orig OK "
           "(this is the shape to copy)\n");

cleanup:
    wc_ForceZero(recovered, sizeof(recovered));
    if (aesReg) {
        wc_Stm32_AesUnRegister(WOLFSSL_STM32_AES_DEVID);
    }
    if (dhukReg) {
        wc_Stm32_DhukUnRegister(WC_DHUK_DEVID);
    }
    return ret;
}
#endif /* WOLF_CRYPTO_CB && (HAVE_AES_ECB || WOLFSSL_AES_DIRECT) */

#ifdef WOLFSSL_STM32_DHUK_UNWRAP
/* [6] wc_Stm32_Aes_DhukOp_ex -- the provisioning flow the API exists for:
 * stage a 256-bit seed, let SAES turn (seed, silicon DHUK) into a key
 * encryption key inside KEYR, and wrap/unwrap other key material with it.
 * The KEK never enters software and is bound to this chip.
 *
 * Contract checked here:
 *   - enc/dec round-trip through the same seed is the identity (ECB + CBC)
 *   - the same seed always yields the same KEK (determinism)
 *   - DhukOp_ex and the crypto-callback device agree byte-for-byte on the
 *     same 32-byte input -- they are the same KEK = DHUK-decrypt(seed)
 *     primitive, so blobs are interchangeable between the two APIs
 *
 * Ciphertext is silicon-specific, so it is printed rather than pinned; the
 * printed values are what the cross-build (BUILD=bare vs BUILD=cubemx)
 * comparison uses. */
static int test_dhuk_op_roundtrip(void)
{
    /* The key we want the DHUK to protect. */
    static const byte kek[32] = {
        0x00,0x11,0x22,0x33,0x44,0x55,0x66,0x77,
        0x88,0x99,0xaa,0xbb,0xcc,0xdd,0xee,0xff,
        0x10,0x32,0x54,0x76,0x98,0xba,0xdc,0xfe,
        0xef,0xcd,0xab,0x89,0x67,0x45,0x23,0x01
    };
    static const byte pt[32] = {
        0x6b,0xc1,0xbe,0xe2,0x2e,0x40,0x9f,0x96,
        0xe9,0x3d,0x7e,0x11,0x73,0x93,0x17,0x2a,
        0xae,0x2d,0x8a,0x57,0x1e,0x03,0xac,0x9c,
        0x9e,0xb7,0x6f,0xac,0x45,0xaf,0x8e,0x51
    };
    Aes    aes;
    byte   wrapped[32];
    byte   ct[32];
    byte   rt[32];
    byte   swCt[32];
    word32 wrappedSz = 0;
    int    ret;
    int    rc = 0;

