dgarske/wolfssl-examples-stm32/STM32_Bare_Test/src/main_dhuk.c
    XMEMSET(wrapped, 0, sizeof(wrapped));
    XMEMSET(ct, 0, sizeof(ct));
    XMEMSET(rt, 0, sizeof(rt));
    XMEMSET(swCt, 0, sizeof(swCt));

    /* Stage 1: wrap K under the silicon DHUK. */
    ret = wc_AesInit(&aes, NULL, WOLFSSL_DHUK_DEVID);
    if (ret != 0) {
        printf("  wc_AesInit (wrap) failed: %d\n", ret);
        return ret;
    }
    ret = wc_Stm32_Aes_Wrap(&aes, kek, sizeof(kek), wrapped, &wrappedSz,
                            NULL, 0);
    wc_AesFree(&aes);
    if (is_expected_gated(ret)) {
        printf("  wc_Stm32_Aes_Wrap gated/unavailable: %d "
               "(expected on this silicon)\n", ret);
        g_dhuk_res.dhukop_rc = ret;
        return 0;
    }
    if (ret != 0) {
        printf("  wc_Stm32_Aes_Wrap failed: %d\n", ret);
        g_dhuk_res.dhukop_rc = ret;
        return ret;
    }
    if (wrappedSz != sizeof(wrapped)) {
        printf("  wc_Stm32_Aes_Wrap outSz %u, want %u -- FAIL\n",
               (unsigned)wrappedSz, (unsigned)sizeof(wrapped));
        g_dhuk_res.dhukop_rc = -1;
        return -1;
    }
    dhuk_print_hex("wrapped blob (chip-bound)", wrapped, sizeof(wrapped));
    XMEMCPY((void*)g_dhuk_res.dhukop_blob, wrapped, sizeof(wrapped));

    /* Stage 2: ECB encrypt through the unwrapped key. */
    ret = wc_AesInit(&aes, NULL, WOLFSSL_DHUK_DEVID);
    if (ret != 0) {
        printf("  wc_AesInit (op) failed: %d\n", ret);
        return ret;
    }
    XMEMCPY(aes.key, wrapped, sizeof(wrapped));
    aes.keylen = 32;
    ret = wc_Stm32_Aes_DhukOp_ex(&aes, ct, pt, sizeof(pt), 1 /* enc */,
                                 0 /* isCbc */);
    if (is_expected_gated(ret)) {
        printf("  DhukOp_ex ECB encrypt gated/unavailable: %d\n", ret);
        wc_AesFree(&aes);
        g_dhuk_res.dhukop_rc = ret;
        return 0;
    }
    if (ret != 0) {
        printf("  DhukOp_ex ECB encrypt failed: %d\n", ret);
        wc_AesFree(&aes);
        g_dhuk_res.dhukop_rc = ret;
        return ret;
    }
    dhuk_print_hex("DhukOp ECB ct", ct, sizeof(ct));

    /* Diagnostic: run the same input through DhukOp twice more, and through
     * the crypto-callback device (which uses Stm32SaesDeriveKeyFromSeed --
     * the same KEK = DHUK-decrypt(input) primitive). Feeding both paths the
     * identical 32 bytes isolates a code difference from an input
     * difference: if the cb path is deterministic and DhukOp is not, the
     * bug is in DhukOp; if they agree, the two are the same primitive. */
    {
        Aes  aes2;
        byte ct2[32];
        byte ct3[32];
        byte cbCt[32];
        int  i;

        for (i = 0; i < 2; i++) {
            byte* dst = (i == 0) ? ct2 : ct3;
            XMEMSET(dst, 0, sizeof(ct2));
            ret = wc_AesInit(&aes2, NULL, WOLFSSL_DHUK_DEVID);
            if (ret != 0) {
                break;
            }
            XMEMCPY(aes2.key, wrapped, sizeof(wrapped));
            aes2.keylen = 32;
            ret = wc_Stm32_Aes_DhukOp_ex(&aes2, dst, pt, sizeof(pt),
                                         1 /* enc */, 0 /* isCbc */);
            wc_AesFree(&aes2);
            if (ret != 0) {
                break;
            }
        }
        if (ret != 0) {
            printf("  repeat probe failed: %d\n", ret);
            rc = -1;
        }
        else {
            dhuk_print_hex("DhukOp ct pass2", ct2, sizeof(ct2));
            dhuk_print_hex("DhukOp ct pass3", ct3, sizeof(ct3));
            if (XMEMCMP(ct2, ct, sizeof(ct)) != 0 ||
                XMEMCMP(ct3, ct, sizeof(ct)) != 0) {
                printf("  DhukOp encrypt NOT deterministic\n");
                rc = -1;
            }
            else {
                printf("  DhukOp encrypt deterministic OK\n");
            }
        }

        /* Same 32 bytes, but through the crypto-callback derive path. */
        XMEMSET(cbCt, 0, sizeof(cbCt));
        ret = wc_Stm32_DhukRegister(WC_DHUK_DEVID);
        if (ret == 0) {
            ret = wc_AesInit(&aes2, NULL, WC_DHUK_DEVID);
            if (ret == 0) {
                ret = wc_AesSetKey(&aes2, wrapped, sizeof(wrapped), NULL,
                                   AES_ENCRYPTION);
                if (ret == 0) {
                    ret = wc_AesEcbEncrypt(&aes2, cbCt, pt, sizeof(pt));
                }
                wc_AesFree(&aes2);
            }
            wc_Stm32_DhukUnRegister(WC_DHUK_DEVID);
        }
        if (ret != 0) {
            printf("  cb-path comparison failed: %d\n", ret);
        }
        else {
            dhuk_print_hex("cb-path ct    ", cbCt, sizeof(cbCt));
            printf("  DhukOp %s cb-path (same 32-byte input)\n",
                   (XMEMCMP(cbCt, ct, sizeof(ct)) == 0) ? "==" : "!=");
        }
        ret = 0;
    }

    /* Stage 3: decrypt back, expect identity. */
    ret = wc_Stm32_Aes_DhukOp_ex(&aes, rt, ct, sizeof(ct), 0 /* dec */,
                                 0 /* isCbc */);
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  DhukOp_ex ECB decrypt failed: %d\n", ret);
        g_dhuk_res.dhukop_rc = ret;
        return ret;
    }
    if (XMEMCMP(rt, pt, sizeof(pt)) != 0) {
        printf("  DhukOp_ex ECB round-trip mismatch -- FAIL\n");
        dhuk_print_hex("got ", rt, sizeof(rt));
        rc = -1;
    }
    else {
        printf("  DhukOp_ex ECB round-trip OK\n");
    }

    /* Stage 4: the recovered KEK must equal K, so a plain AES keyed with K
     * has to produce the same ciphertext. A mismatch here means the unwrap
     * landed a different key (or the blob byte order disagrees) -- report
     * it loudly but keep it separate from the round-trip result so the two
     * failure modes stay distinguishable. */
    {
        static const char* names[4] = {
            "K as-is", "K byte-reversed", "K word-order-reversed",
            "K per-word byteswapped"
        };
        byte cand[32];
        int  v;
        int  j;
        int  hit = -1;

        for (v = 0; v < 4; v++) {
            switch (v) {
                case 0:
                    XMEMCPY(cand, kek, sizeof(cand));
                    break;
                case 1:
                    for (j = 0; j < 32; j++) {
                        cand[j] = kek[31 - j];
                    }
                    break;
                case 2:
                    for (j = 0; j < 8; j++) {
                        XMEMCPY(cand + 4 * j, kek + 4 * (7 - j), 4);
                    }
                    break;
                default:
                    for (j = 0; j < 8; j++) {
                        cand[4 * j + 0] = kek[4 * j + 3];
                        cand[4 * j + 1] = kek[4 * j + 2];
                        cand[4 * j + 2] = kek[4 * j + 1];
                        cand[4 * j + 3] = kek[4 * j + 0];
                    }
                    break;
            }
            ret = wc_AesInit(&aes, NULL, INVALID_DEVID);
            if (ret != 0) {
                break;
            }
            ret = wc_AesSetKey(&aes, cand, sizeof(cand), NULL, AES_ENCRYPTION);
            if (ret == 0) {
                ret = wc_AesEcbEncrypt(&aes, swCt, pt, sizeof(pt));
            }
            wc_AesFree(&aes);
            if (ret != 0) {
                break;
            }
            if (XMEMCMP(swCt, ct, sizeof(ct)) == 0) {
                hit = v;
                break;
            }
        }
        if (ret != 0) {
            printf("  reference AES-ECB unavailable (%d) -- skipping\n", ret);
            ret = 0;
        }
        else if (hit < 0) {
            /* Informational only. The DHUK contract this API provides is
             * "seed -> chip-bound KEK", not "wc_Stm32_Aes_Wrap is the exact
             * inverse of the DhukOp unwrap". On U385 the recovered KEK is
             * not K under any word/byte permutation, so the two are NOT
             * inverse operations -- callers must not assume a blob produced
             * by wc_Stm32_Aes_Wrap unwraps back to its plaintext input. */
            printf("  note: KEK != K under any word/byte permutation --\n"
                   "  wc_Stm32_Aes_Wrap is not the inverse of the unwrap\n");
        }
        else {
            printf("  DhukOp ct == AES-ECB(%s, pt)\n", names[hit]);
        }
    }

    /* CBC through the same seed must also round-trip. */
    {
        static const byte iv0[16] = {
            0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
            0x08,0x09,0x0a,0x0b,0x0c,0x0d,0x0e,0x0f
        };
        Aes  aesc;
        byte cbcCt[32];
        byte cbcRt[32];

        XMEMSET(cbcCt, 0, sizeof(cbcCt));
        XMEMSET(cbcRt, 0, sizeof(cbcRt));
        ret = wc_AesInit(&aesc, NULL, WOLFSSL_DHUK_DEVID);
        if (ret == 0) {
            XMEMCPY(aesc.key, wrapped, sizeof(wrapped));
            aesc.keylen = 32;
            XMEMCPY(aesc.reg, iv0, sizeof(iv0));
            ret = wc_Stm32_Aes_DhukOp_ex(&aesc, cbcCt, pt, sizeof(pt),
                                         1 /* enc */, 1 /* isCbc */);
            if (ret == 0) {
                XMEMCPY(aesc.reg, iv0, sizeof(iv0));
                ret = wc_Stm32_Aes_DhukOp_ex(&aesc, cbcRt, cbcCt,
                                             sizeof(cbcCt), 0 /* dec */,
                                             1 /* isCbc */);
            }
            wc_AesFree(&aesc);
        }
        if (ret != 0) {
            printf("  DhukOp_ex CBC failed: %d\n", ret);
            rc = -1;
        }
        else if (XMEMCMP(cbcRt, pt, sizeof(pt)) != 0) {
            printf("  DhukOp_ex CBC round-trip mismatch -- FAIL\n");
            dhuk_print_hex("got ", cbcRt, sizeof(cbcRt));
            rc = -1;
        }
        else if (XMEMCMP(cbcCt, ct, sizeof(ct)) == 0) {
            printf("  DhukOp_ex CBC ct == ECB ct -- IV not applied, FAIL\n");
            rc = -1;
        }
        else {
            printf("  DhukOp_ex CBC round-trip OK (IV applied)\n");
        }
        ret = 0;
    }

    g_dhuk_res.dhukop_rc = rc;
    return rc;
}
#endif /* WOLFSSL_STM32_DHUK_UNWRAP */

#endif /* WOLFSSL_DHUK && (BARE || CUBEMX) && WC_STM32_HAS_DHUK */


#if defined(HAVE_ECC) && defined(WOLFSSL_STM32_PKA)
/* [10] Sign with a wrapped scalar imported onto a key that was never used for
 * keygen -- the shape a product actually has at runtime, where provisioning
 * happened in the factory and only the blob plus the seed reach flash. The
 * surrounding ECDSA test starts from wc_ecc_make_key_ex(), which hides whether
 * wc_ecc_import_wrapped_private() leaves the key ready to sign; this does not.
 * The signature is verified against the public counterpart, so a scalar that
 * unwrapped to the wrong value fails here rather than passing silently. */
static int test_dhuk_ecdsa_import_sign(WC_RNG* rng)
{
    static const byte seed[32] = {
        0x00,0x11,0x22,0x33,0x44,0x55,0x66,0x77,
        0x88,0x99,0xaa,0xbb,0xcc,0xdd,0xee,0xff,
        0x10,0x32,0x54,0x76,0x98,0xba,0xdc,0xfe,
        0xef,0xcd,0xab,0x89,0x67,0x45,0x23,0x01
    };
    static const byte hash[32] = {
        0x01,0x02,0x03,0x04,0x05,0x06,0x07,0x08,
        0x09,0x0a,0x0b,0x0c,0x0d,0x0e,0x0f,0x10,
        0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18,
        0x19,0x1a,0x1b,0x1c,0x1d,0x1e,0x1f,0x20
    };
    ecc_key kp;
    ecc_key signer;
    ecc_key verifier;
    Aes     aes;
    byte    priv[32];
    byte    wrapped[32];
    byte    pub[65];
    byte    sig[80];
    word32  privSz = (word32)sizeof(priv);
    word32  pubSz  = (word32)sizeof(pub);
    word32  sigLen = (word32)sizeof(sig);
    int     verify = 0;
    int     dhukReg = 0;
    int     ret;

    ret = wc_Stm32_DhukRegister(WC_DHUK_DEVID);
    if (ret != 0) {
        printf("  DHUK register failed: %d\n", ret);
        return ret;
    }
    dhukReg = 1;

    /* Factory half: keypair, export the scalar and the public key. */
    ret = wc_ecc_init(&kp);
    if (ret != 0) {
        goto cleanup;
    }
    ret = wc_ecc_make_key_ex(rng, 32, &kp, ECC_SECP256R1);
    if (ret == 0) {
        ret = wc_ecc_export_private_only(&kp, priv, &privSz);
    }
    if (ret == 0) {
        ret = wc_ecc_export_x963(&kp, pub, &pubSz);
    }
    wc_ecc_free(&kp);
    if (ret != 0 || privSz != 32u) {
        printf("  provisioning failed: %d (privSz %lu)\n", ret,
               (unsigned long)privSz);
        ret = (ret != 0) ? ret : -1;
        goto cleanup;
    }

    /* Wrap the scalar under the DHUK-derived key. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, seed, (word32)sizeof(seed), NULL,
                           AES_ENCRYPTION);
        if (ret == 0) {
            ret = wc_AesEcbEncrypt(&aes, wrapped, priv, 32);
        }
        wc_AesFree(&aes);
    }
    wc_ForceZero(priv, sizeof(priv));
    if (is_expected_gated(ret)) {
        printf("  KEK wrap gated on this silicon (%d) -- skipping\n", ret);
        ret = 0;
        goto cleanup;
    }
    if (ret != 0) {
        printf("  KEK wrap failed: %d\n", ret);
        goto cleanup;
    }

