dgarske/wolfssl-examples-stm32/STM32_Bare_Test/src/main_dhuk.c
    /* Runtime half: a key that has only ever seen wc_ecc_init(). */
    ret = wc_ecc_init(&signer);
    if (ret != 0) {
        goto cleanup;
    }
    signer.devId = WC_DHUK_DEVID;
    ret = wc_ecc_import_wrapped_private(&signer, ECC_SECP256R1, seed,
                                        (word32)sizeof(seed), wrapped, 32, 32);
    if (ret == 0) {
        ret = wc_ecc_sign_hash(hash, (word32)sizeof(hash), sig, &sigLen, rng,
                               &signer);
    }
    wc_ecc_free(&signer);
    if (is_expected_gated(ret)) {
        printf("  DHUK sign gated on this silicon (%d) -- skipping\n", ret);
        ret = 0;
        goto cleanup;
    }
    if (ret != 0) {
        printf("  sign after import failed: %d "
               "(-170 means the import left no curve on the key)\n", ret);
        goto cleanup;
    }
    printf("  signed with an imported scalar, no keygen (%lu-byte sig)\n",
           (unsigned long)sigLen);

    /* The signature must verify against the provisioned public key. */
    ret = wc_ecc_init(&verifier);
    if (ret == 0) {
        ret = wc_ecc_import_x963_ex(pub, pubSz, &verifier, ECC_SECP256R1);
        if (ret == 0) {
            ret = wc_ecc_verify_hash(sig, sigLen, hash, (word32)sizeof(hash),
                                     &verify, &verifier);
        }
        wc_ecc_free(&verifier);
    }
    if (ret != 0 || verify != 1) {
        printf("  signature did not verify (ret=%d verify=%d) -- FAIL\n",
               ret, verify);
        ret = (ret != 0) ? ret : -1;
        goto cleanup;
    }
    printf("  verifies against the provisioned public key OK\n");

cleanup:
    if (dhukReg) {
        wc_Stm32_DhukUnRegister(WC_DHUK_DEVID);
    }
    return ret;
}
#endif /* HAVE_ECC && WOLFSSL_STM32_PKA */

int main(void)
{
    int ret = 0;

    board_init();
    SystemCoreClockUpdate();

    printf("\n");
    printf("========================================\n");
    printf("wolfCrypt DHUK test - %s (CONFIG=%s)\n",
           board_name(), BUILD_CONFIG_NAME);
    printf("wolfSSL version: %s\n", LIBWOLFSSL_VERSION_STRING);
    printf("SYSCLK: expected %lu Hz, CMSIS-reported %lu Hz%s\n",
           (unsigned long)board_sysclk_hz(),
           (unsigned long)SystemCoreClock,
           ((unsigned long)SystemCoreClock == (unsigned long)board_sysclk_hz())
               ? " (match)" : " (MISMATCH -- PLL may have failed)");
    printf("========================================\n\n");

    ret = wolfCrypt_Init();
    if (ret != 0) {
        printf("wolfCrypt_Init failed: %d\n", ret);
        for (;;) { }
    }

#if defined(WOLFSSL_DHUK) && \
    (defined(WOLFSSL_STM32_BARE) || defined(WOLFSSL_STM32_CUBEMX)) && \
    defined(WC_STM32_HAS_DHUK)
    {
        WC_RNG rng;

        printf("[1] ECC DHUK setter validation (SW unit test):\n");
        ret = test_ecc_dhuk_setter();
        if (ret != 0) {
            goto done;
        }

        ret = wc_InitRng(&rng);
        if (ret != 0) {
            printf("  wc_InitRng failed: %d\n", ret);
            goto done;
        }

#ifdef WOLF_CRYPTO_CB
        if (ret == 0) {
            printf("\n[2] GMAC via transparent DHUK crypto-callback:\n");
            ret = test_dhuk_cryptocb_gmac();
        }
#if defined(HAVE_AES_ECB) || defined(WOLFSSL_AES_DIRECT)
        if (ret == 0) {
            printf("\n[3] AES-ECB via transparent DHUK crypto-callback:\n");
            ret = test_dhuk_cryptocb_ecb();
        }
#endif
#if defined(HAVE_AES_CBC)
        if (ret == 0) {
            printf("\n[5] AES-CBC via transparent DHUK crypto-callback:\n");
            ret = test_dhuk_cryptocb_cbc();
        }
#endif
#if defined(HAVE_ECC) && defined(WOLFSSL_STM32_PKA)
        if (ret == 0) {
            printf("\n[4] ECDSA sign via transparent DHUK crypto-callback:\n");
            ret = test_dhuk_cryptocb_ecdsa(&rng);
        }
#endif
#if defined(HAVE_ECC) && defined(WOLFSSL_STM32_PKA)
        if (ret == 0) {
            printf("\n[10] ECDSA sign from an imported wrapped scalar "
                   "(no keygen):\n");
            ret = test_dhuk_ecdsa_import_sign(&rng);
        }
#endif
#endif
#ifdef WOLFSSL_STM32_DHUK_UNWRAP
        if (ret == 0) {
            printf("\n[6] wc_Stm32_Aes_DhukOp_ex wrap/unwrap round-trip:\n");
            ret = test_dhuk_op_roundtrip();
        }
#endif
        if (ret == 0) {
            printf("\n[7] wc_Stm32_Aes_Wrap blob word order:\n");
            ret = test_dhuk_wrap_order();
        }
#if defined(WOLF_CRYPTO_CB) && \
    (defined(HAVE_AES_ECB) || defined(WOLFSSL_AES_DIRECT))
        if (ret == 0) {
            printf("\n[9] wc_Stm32_Aes_Wrap blob used as a key "
                   "round-trips back to K:\n");
            ret = test_dhuk_wrap_as_key();
        }
#endif
#if defined(WOLF_CRYPTO_CB) && defined(HAVE_AES_CBC) && \
    (defined(HAVE_AES_ECB) || defined(WOLFSSL_AES_DIRECT))
        if (ret == 0) {
            printf("\n[8] Provisioning reference (start here):\n");
            ret = dhuk_provision_example(&rng);
        }
#endif

        wc_FreeRng(&rng);
    }
#else
    printf("DHUK not enabled in this build (need WOLFSSL_DHUK + "
           "WOLFSSL_STM32_BARE or WOLFSSL_STM32_CUBEMX + "
           "WC_STM32_HAS_DHUK).\n");
    ret = -1;
#endif

done:
    g_dhuk_res.overall = ret;
    g_dhuk_res.magic = 0xD04B0001u;
    wolfCrypt_Cleanup();
    printf("\nResult: %d (%s)\n", ret, ret == 0 ? "PASS" : "FAIL");
    printf("Test complete\n");

    for (;;) { }
}
